        ## looking at 3 csv files: movie_gross.csv, movie_budgets.csv, movies.csv

### Looking at Movie Gross

In [2]:
import pandas as pd
import numpy as np

In [4]:
gross = pd.read_csv('zippedData/bom.movie_gross.csv.gz')
gross.head(3)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010

In [9]:
gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [10]:
#making foreign gross a series
gross_revenue = pd.Series(gross['foreign_gross'])

In [11]:
#changing to a datatype that can do calculations
pd.to_numeric(gross_revenue, errors='ignore')

0       652000000
1       691300000
2       664300000
3       535700000
4       513900000
          ...
3382          NaN
3383          NaN
3384          NaN
3385          NaN
3386          NaN
Name: foreign_gross, Length: 3387, dtype: object

## Which Genres Make the Most Money?

In [ ]:
#join movie_gross with title_basics, which contains a genre column

In [12]:
#look at dataframes
title_basics = pd.read_csv('zippedData/imdb.title.basics.csv.gz')
title_basics.head(3)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama

In [13]:
gross.head(3)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010

In [14]:
#check datatypes
gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [15]:
#change foreign gross to a float
gross['foreign_gross'] = pd.to_numeric(gross['foreign_gross'], errors='coerce', downcast='float')

gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2032 non-null   float32
 4   year            3387 non-null   int64
dtypes: float32(1), float64(1), int64(1), object(2)
memory usage: 119.2+ KB

In [16]:
#join title_basics and gross, drop non-relevant columns
finance = title_basics.join(gross, how = 'outer')
finance.drop(columns = ['runtime_minutes', 'studio', 'start_year', 'original_title', 'tconst', 'primary_title'], inplace=True)
total_gross = gross['domestic_gross'] + gross['foreign_gross']

#make a new column for total gross revenue, sum of domestic & foreign
finance['total gross'] = total_gross

#total gross is very big so dividing by $1M
finance['total gross in millions'] = (finance['total gross'].apply(lambda x: x/1,000,000))

#change foreign gross to a float
gross['foreign_gross'] = pd.to_numeric(gross['foreign_gross'], errors='coerce', downcast='float')

finance.head(3)

,genres,title,domestic_gross,foreign_gross,year,total gross,total gross in millions
0,"Action,Crime,Drama",Toy Story 3,415000000.0,652000000.0,2010.0,1.067000e+09,1.067e+09
1,"Biography,Drama",Alice in Wonderland (2010),334200000.0,691299968.0,2010.0,1.025500e+09,1.0255e+09
2,Drama,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300032.0,2010.0,9.603000e+08,9.603e+08

In [17]:
#check data type of total gross in millions column
finance.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146144 entries, 0 to 146143
Data columns (total 7 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   genres                   140736 non-null  object
 1   title                    3387 non-null    object
 2   domestic_gross           3359 non-null    float64
 3   foreign_gross            2032 non-null    float32
 4   year                     3387 non-null    float64
 5   total gross              2004 non-null    float64
 6   total gross in millions  2004 non-null    object
dtypes: float32(1), float64(3), object(3)
memory usage: 8.4+ MB

In [99]:
#remove scientific notation from total gross in millions column
#first change object type
finance['total gross in millions'] = pd.to_numeric(finance['total gross in millions'])

finance.head(10)

,genres,title,domestic_gross,foreign_gross,year,total gross,total gross in millions
0,"Action,Crime,Drama",Toy Story 3,415000000.0,652000000.0,2010.0,1.067000e+09,NaN
1,"Biography,Drama",Alice in Wonderland (2010),334200000.0,691299968.0,2010.0,1.025500e+09,NaN
2,Drama,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300032.0,2010.0,9.603000e+08,NaN
3,"Comedy,Drama",Inception,292600000.0,535700000.0,2010.0,8.283000e+08,NaN
4,"Comedy,Drama,Fantasy",Shrek Forever After,238700000.0,513900000.0,2010.0,7.526000e+08,NaN
5,Comedy,The Twilight Saga: Eclipse,300500000.0,398000000.0,2010.0,6.985000e+08,NaN
6,"Horror,Thriller",Iron Man 2,312400000.0,311500000.0,2010.0,6.239000e+08,NaN
7,"Adventure,Animation,Comedy",Tangled,200800000.0,391000000.0,2010.0,5.918000e+08,NaN
8,"Documentary,History",Despicable Me,251500000.0,291600000.0,2010.0,5.431000e+08,NaN
9,Biography,How to Train Your Dragon,217600000.0,277300000.0,2010.0,4.949000e+08,NaN

In [80]:
finance.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   genres          140736 non-null  object
 1   title           3387 non-null    object
 2   domestic_gross  3359 non-null    float64
 3   foreign_gross   2032 non-null    float32
 4   year            3387 non-null    float64
 5   total gross     2004 non-null    object
dtypes: float32(1), float64(2), object(3)
memory usage: 7.2+ MB

### Looking at Movie Budgets

In [24]:
budgets = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')
budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [26]:
budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [31]:
#change production_budget, domestic_gross, worldwide gross to numeric types
p_budget = pd.Series(gross['production_budget'])
pd.to_numeric(p_budget, errors='ignore')

KeyError: 'production_budget'